
// Задание 6

// Спрашивайте у пользователя число пока он не введет 100. Решите через while и do-while.


// Задание 7

// Спросите у пользователя положительное число: и выведите все числа в обратном порядке до 0.
// Если число не положительное — выводить ошибку.

// Работа с && (и) и || (или)
// Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 5, 0, -3, 2.
// Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.
// Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания). // Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5.
// Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.

// Задание 8

// Спросите у пользователя 2 числа, и выведите подряд все числа
// начиная с первого по второе. Если первое число больше
// второго — выводить ошибку.


// Задание 9

// Спросите у пользователя 3 числа: с какого числа выводить,
// по какое число выводить и на сколько увеличить число каждый шаг
// и выведите подряд все числа. Если первый параметр больше
// второго — выводить ошибку.


// Задание 10

// Спросите у пользователя положительное число: и выведите
// все числа в обратном порядке до 0. Если число не положительное — выводить ошибку.


// Задание 11

// Спросите у пользователя положительное число: и посчитайте сумму всех
// чисел от 1 до этого числа. Если число не положительное  — выводить ошибку.


// Задание 12

// Спрашивайте у пользователя число пока он не введет 100
// Решите через while и do-while
















